<?php
function toText($i)
{
    $nums = [
        "صفر",
        "یەک",
        "دوو",
        "سێ",
        "چوار",
        "پێنج",
        "شەش",
        "حەوت",
        "هەشت",
        "نۆ",
        "دە",
        "یانزە",
        "دوانزە",
        "سیانزە",
        "چواردە",
        "پانزە",
        "شانزە",
        "حەڤە",
        "هەژدە",
        "نۆزدە",
        "بیست",
        "بیست و یەک",
        "بیست و دوو",
        "بیست و سێ",
        "بیست و چوار",
        "بیست و پێنج",
        "بیست و شەش",
        "بیست و حەوت",
        "بیست و هەشت",
        "بیست و نۆ",
        "سی",
        "سی و یەک",
        "سی و دوو",
        "سی و سێ",
        "سی و چوار",
        "سی و پێنج",
        "سی و شەش",
        "سی و حەوت",
        "سی و هەشت",
        "سی و نۆ",
        "چل",
        "چل و یەک",
        "چل و دوو",
        "چل و سێ",
        "چل و چوار",
        "چل و پێنج",
        "چل و شەش",
        "چل و حەوت",
        "چل و هەشت",
        "چل و نۆ",
        "پەنجا",
        "پەنجا و یەک",
        "پەنجا و دوو",
        "پەنجا و سێ",
        "پەنجا و چوار",
        "پەنجا و پێنج",
        "پەنجا و شەش",
        "پەنجا و حەوت",
        "پەنجا و هەشت",
        "پەنجا و نۆ",
        "شەست",
        "شەست و یەک",
        "شەست و دوو",
        "شەست و سێ",
        "شەست و چوار",
        "شەست و پێنج",
        "شەست و شەش",
        "شەست و حەوت",
        "شەست و هەشت",
        "شەست و نۆ",
        "حەفتا",
        "حەفتا و یەک",
        "حەفتا و دوو",
        "حەفتا و سێ",
        "حەفتا و چوار",
        "حەفتا و پێنج",
        "حەفتا و شەش",
        "حەفتا و حەوت",
        "حەفتا و هەشت",
        "حەفتا و نۆ",
        "هەشتا",
        "هەشتا و یەک",
        "هەشتا و دوو",
        "هەشتا و سێ",
        "هەشتا و چوار",
        "هەشتا و پێنج",
        "هەشتا و شەش",
        "هەشتا و حەوت",
        "هەشتا و هەشت",
        "هەشتا و نۆ",
        "نەوە",
        "نەوە و یەک",
        "نەوە و دوو",
        "نەوە و سێ",
        "نەوە و چوار",
        "نەوە و پێنج",
        "نەوە و شەش",
        "نەوە و حەوت",
        "نەوە و هەشت",
        "نەوە و نۆ",
        "سەت"
    ];
    return $nums[$i];
}
function setRange($i)
{
    if($i < 50){
        return "کەوتوو";
    }elseif ($i >= 50 && $i < 60) {
        return "پەسەند";

    }elseif ($i >= 60 && $i < 70) {
        return "ناوەند";

    }elseif ($i >= 70 && $i < 80) {
        return "باش";

    }elseif ($i >= 80 && $i < 90) {
        return "زۆرباش";

    }elseif ($i >= 90 && $i <= 100) {
        return "نایاب";
    }
}